/*
TODO: Problem-17: জাভাস্ক্রিপ্ট ,অবজেক্ট ও JSON স্ট্রিং এর মধ্যে কি কি পার্থক্য ?
*/

// Solution: 
/*
 ১।  JSON স্ট্রিং এর প্রপার্টি নাম গুলো ডাবল কোটেশনে থাকে , জাভাস্ক্রিপ্ট থাকে না। 
২।  জাভাস্ক্রিপ্টের অবজেক্টর মধ্যে কোনো প্রোপার্টির মান হিসাবে ফাংশন থাকতে পারে। যেটাকে আমরা মেথড বলে থাকি।  তবে জেসনের মধ্যে ভ্যালু হিসাবে স্ট্রিং , সংখ্যা , বুলিয়ান , এরে, অবজেক্ট থাকতে পারে।  তবে ফাংশন থাকে না 
৩।  জাভাস্ক্রিপ্ট অবজেক্ট লেখার সময় স্ট্রিং মানের জন্য সিঙ্গেল কোটেশন use করতে পারি তবে জেসন এর স্ট্রিং মানের জন্য ডাবল কোটেশন ব্যবহার করতে হয় */
