/*
TODO: Problem-36: HTTP এর মেথড বা VERB কি কি আছে ? কোনটার কি কাজ ?
*/

// Answer:
// HTTP এর মেথড বা VERB হলো GET, POST, PUT, PATCH, DELETE, OPTIONS, HEAD ইত্যাদি ।
// GET: সার্ভার থেকে ডাটা রিকোয়েস্ট করার জন্য ব্যবহৃত হয় ।
// POST: সার্ভারে নতুন ডাটা তৈরি করার জন্য ব্যবহৃত হয় ।
// PUT: সার্ভারে বিদ্যমান ডাটা সম্পূর্ণভাবে আপডেট করার জন্য ব্যবহৃত হয় ।
// PATCH: সার্ভারে বিদ্যমান ডাটার কিছু অংশ আপডেট করার জন্য ব্যবহৃত হয় ।
// DELETE: সার্ভার থেকে ডাটা মুছে ফেলার জন্য ব্যবহৃত হয় ।
// OPTIONS: সার্ভারের সাথে যোগাযোগ করার জন্য কোন HTTP মেথডগুলি সমর্থিত তা জানতে ব্যবহৃত হয় ।
// HEAD: GET এর মতোই কাজ করে কিন্তু সার্ভার থেকে শুধুমাত্র হেডার তথ্য রিটার্ন করে, বডি রিটার্ন করে না ।