/*
TODO: Problem-12: Question: ইনহেরিটেন্স কি জিনিস ? এইটা কেন দরকার  ?
*/

/*Answer: ইনহেরিটেন্স (Inheritance) হলো একটি ক্লাসের বৈশিষ্ট্য (Properties) এবং কাজ (Methods) অন্য একটি ক্লাসে কপি না করে সরাসরি ব্যবহার করার প্রক্রিয়া।
সহজ কথায়, বাবা-মায়ের বৈশিষ্ট্য যেমন সন্তান পায়, তেমনি প্যারেন্ট ক্লাসের সব ক্ষমতা চাইল্ড ক্লাস নিজে থেকেই পেয়ে  


এটি কেন দরকার?

• কোড বাঁচানো (Reusability): একই কোড বারবার লিখতে হয় না, একবার লিখে বারবার ব্যবহার করা যায়।
• সহজ পরিবর্তন (Easy Maintenance): মূল (Parent) ক্লাসে কোনো কিছু পরিবর্তন করলে সব চাইল্ড ক্লাসে তা নিজে থেকেই বদলে যায়।
• সময় বাঁচানো: দ্রুত ও পরিচ্ছন্নভাবে প্রোগ্রাম তৈরি করা যায়।

*/